In [7]:
import numpy as np
import pandas as pd
# create data
stuff = {
  'corporation': ['Apple', "google", 'Meta',"Apple"],
  "employees":["john","april","aviral","steph"],
  "salary(in lakhs)":[25,45,100,12]}
# create dataframe
my_df = pd.DataFrame(stuff)
my_df

  corporation employees  salary(in lakhs)
0       Apple      john                25
1      google     april                45
2        Meta    aviral               100
3       Apple     steph                12

In [8]:
# group by corporation - to get object location in memory
company = my_df.groupby('corporation')
company

In [9]:
# sum
company.sum()

             employees  salary(in lakhs)
corporation
Apple        johnsteph                37
Meta            aviral               100
google           april                45